FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
    __IO uint32_t PWRCTL;   /*!< [0x0000] System Power-down Control Register                               */
    __IO uint32_t AHBCLK;   /*!< [0x0004] AHB Devices Clock Enable Control Register                        */
    __IO uint32_t APBCLK0;  /*!< [0x0008] APB Devices Clock Enable Control Register 0                      */
    __IO uint32_t APBCLK1;  /*!< [0x000C] APB Devices Clock Enable Control Register 1                      */
    __IO uint32_t CLKSEL0;  /*!< [0x0010] Clock Source Select Control Register 0                           */
    __IO uint32_t CLKSEL1;  /*!< [0x0014] Clock Source Select Control Register 1                           */
    __IO uint32_t CLKSEL2;  /*!< [0x0018] Clock Source Select Control Register 2                           */
    __IO uint32_t CLKSEL3;  /*!< [0x001C] Clock Source Select Control Register 3                           */
    __IO uint32_t CLKDIV0;  /*!< [0x0020] Clock Divider Number Register 0                                  */
    __IO uint32_t CLKDIV1;  /*!< [0x0024] Clock Divider Number Register 1                                  */
    __I uint32_t RESERVE0[ 2 ];
    __IO uint32_t CLKDIV4;  /*!< [0x0030] Clock Divider Number Register 4                                  */
    __IO uint32_t PCLKDIV;  /*!< [0x0034] APB Clock Divider Register                                       */
    __I uint32_t RESERVE1[ 2 ];
    __IO uint32_t PLLCTL;   /*!< [0x0040] PLL Control Register                                             */
    __I uint32_t RESERVE2[ 3 ];
    __I uint32_t STATUS;    /*!< [0x0050] Clock Status Monitor Register                                    */
    __I uint32_t RESERVE3[ 3 ];
    __IO uint32_t CLKOCTL;  /*!< [0x0060] Clock Output Control Register                                    */
    __I uint32_t RESERVE4[ 3 ];
    __IO uint32_t CLKDCTL;  /*!< [0x0070] Clock Fail Detector Control Register                             */
    __IO uint32_t CLKDSTS;  /*!< [0x0074] Clock Fail Detector Status Register                              */
    __IO uint32_t CDUPB;    /*!< [0x0078] Clock Frequency Detector Upper Boundary Register                 */
    __IO uint32_t CDLOWB;   /*!< [0x007C] Clock Frequency Detector Low Boundary Register                   */
    __I uint32_t RESERVE5[ 4 ];
    __IO uint32_t PMUCTL;   /*!< [0x0090] Power Manager Control Register                                   */
    __IO uint32_t PMUSTS;   /*!< [0x0094] Power Manager Status Register                                    */
    __I uint32_t RESERVE6[ 1 ];
    __IO uint32_t SWKDBCTL; /*!< [0x009C] Standby Power-down Wake-up De-bounce Control Register            */
    __IO uint32_t PASWKCTL; /*!< [0x00A0] GPA Standby Power-down Wake-up Control Register                  */
    __IO uint32_t PBSWKCTL; /*!< [0x00A4] GPB Standby Power-down Wake-up Control Register                  */
    __IO uint32_t PCSWKCTL; /*!< [0x00A8] GPC Standby Power-down Wake-up Control Register                  */
    __IO uint32_t PDSWKCTL; /*!< [0x00AC] GPD Standby Power-down Wake-up Control Register                  */
    __IO uint32_t IOPDCTL;  /*!< [0x00B0] GPIO Standby Power-down Control Register                         */
    __IO uint32_t HXTFSEL;  /*!< [0x00B4] HXT Filter Select Control Register                               */
} CLK_T;

/**
 *  @addtogroup CLK_CONST CLK Bit Field Definition
 *  Constant Definitions for CLK Controller
 * @{ */

#define CLK_PWRCTL_HXTEN_Pos            ( 0 )                                              /*!< CLK_T::PWRCTL: HXTEN Position          */
#define CLK_PWRCTL_HXTEN_Msk            ( 0x1ul << CLK_PWRCTL_HXTEN_Pos )                  /*!< CLK_T::PWRCTL: HXTEN Mask              */

#define CLK_PWRCTL_LXTEN_Pos            ( 1 )                                              /*!< CLK_T::PWRCTL: LXTEN Position          */
#define CLK_PWRCTL_LXTEN_Msk            ( 0x1ul << CLK_PWRCTL_LXTEN_Pos )                  /*!< CLK_T::PWRCTL: LXTEN Mask              */

#define CLK_PWRCTL_HIRCEN_Pos           ( 2 )                                              /*!< CLK_T::PWRCTL: HIRCEN Position         */
#define CLK_PWRCTL_HIRCEN_Msk           ( 0x1ul << CLK_PWRCTL_HIRCEN_Pos )                 /*!< CLK_T::PWRCTL: HIRCEN Mask             */

#define CLK_PWRCTL_LIRCEN_Pos           ( 3 )                                              /*!< CLK_T::PWRCTL: LIRCEN Position         */
#define CLK_PWRCTL_LIRCEN_Msk           ( 0x1ul << CLK_PWRCTL_LIRCEN_Pos )                 /*!< CLK_T::PWRCTL: LIRCEN Mask             */

#define CLK_PWRCTL_PDWKIEN_Pos          ( 5 )                                              /*!< CLK_T::PWRCTL: PDWKIEN Position        */
#define CLK_PWRCTL_PDWKIEN_Msk          ( 0x1ul << CLK_PWRCTL_PDWKIEN_Pos )                /*!< CLK_T::PWRCTL: PDWKIEN Mask            */

#define CLK_PWRCTL_PDWKIF_Pos           ( 6 )                                              /*!< CLK_T::PWRCTL: PDWKIF Position         */
#define CLK_PWRCTL_PDWKIF_Msk           ( 0x1ul << CLK_PWRCTL_PDWKIF_Pos )                 /*!< CLK_T::PWRCTL: PDWKIF Mask             */

#define CLK_PWRCTL_PDEN_Pos             ( 7 )                                              /*!< CLK_T::PWRCTL: PDEN Position           */
#define CLK_PWRCTL_PDEN_Msk             ( 0x1ul << CLK_PWRCTL_PDEN_Pos )                   /*!< CLK_T::PWRCTL: PDEN Mask               */

#define CLK_PWRCTL_HXTGAIN_Pos          ( 10 )                                             /*!< CLK_T::PWRCTL: HXTGAIN Position        */
#define CLK_PWRCTL_HXTGAIN_Msk          ( 0x3ul << CLK_PWRCTL_HXTGAIN_Pos )                /*!< CLK_T::PWRCTL: HXTGAIN Mask            */

#define CLK_PWRCTL_HXTSELTYP_Pos        ( 12 )                                             /*!< CLK_T::PWRCTL: HXTSELTYP Position      */
#define CLK_PWRCTL_HXTSELTYP_Msk        ( 0x1ul << CLK_PWRCTL_HXTSELTYP_Pos )              /*!< CLK_T::PWRCTL: HXTSELTYP Mask          */

#define CLK_PWRCTL_HXTTBEN_Pos          ( 13 )                                             /*!< CLK_T::PWRCTL: HXTTBEN Position        */
#define CLK_PWRCTL_HXTTBEN_Msk          ( 0x1ul << CLK_PWRCTL_HXTTBEN_Pos )                /*!< CLK_T::PWRCTL: HXTTBEN Mask            */

#define CLK_PWRCTL_HIRC48EN_Pos         ( 18 )                                             /*!< CLK_T::PWRCTL: HIRC48EN Position       */
#define CLK_PWRCTL_HIRC48EN_Msk         ( 0x1ul << CLK_PWRCTL_HIRC48EN_Pos )               /*!< CLK_T::PWRCTL: HIRC48EN Mask           */

#define CLK_AHBCLK_PDMA0CKEN_Pos        ( 0 )                                              /*!< CLK_T::AHBCLK: PDMA0CKEN Position      */
#define CLK_AHBCLK_PDMA0CKEN_Msk        ( 0x1ul << CLK_AHBCLK_PDMA0CKEN_Pos )              /*!< CLK_T::AHBCLK: PDMA0CKEN Mask          */

#define CLK_AHBCLK_PDMA1CKEN_Pos        ( 1 )                                              /*!< CLK_T::AHBCLK: PDMA1CKEN Position      */
#define CLK_AHBCLK_PDMA1CKEN_Msk        ( 0x1ul << CLK_AHBCLK_PDMA1CKEN_Pos )              /*!< CLK_T::AHBCLK: PDMA1CKEN Mask          */

