FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_AHBCLK_ISPCKEN_Pos          ( 2 )                                              /*!< CLK_T::AHBCLK: ISPCKEN Position        */
#define CLK_AHBCLK_ISPCKEN_Msk          ( 0x1ul << CLK_AHBCLK_ISPCKEN_Pos )                /*!< CLK_T::AHBCLK: ISPCKEN Mask            */

#define CLK_AHBCLK_EBICKEN_Pos          ( 3 )                                              /*!< CLK_T::AHBCLK: EBICKEN Position        */
#define CLK_AHBCLK_EBICKEN_Msk          ( 0x1ul << CLK_AHBCLK_EBICKEN_Pos )                /*!< CLK_T::AHBCLK: EBICKEN Mask            */

#define CLK_AHBCLK_SDH0CKEN_Pos         ( 6 )                                              /*!< CLK_T::AHBCLK: SDH0CKEN Position       */
#define CLK_AHBCLK_SDH0CKEN_Msk         ( 0x1ul << CLK_AHBCLK_SDH0CKEN_Pos )               /*!< CLK_T::AHBCLK: SDH0CKEN Mask           */

#define CLK_AHBCLK_CRCCKEN_Pos          ( 7 )                                              /*!< CLK_T::AHBCLK: CRCCKEN Position        */
#define CLK_AHBCLK_CRCCKEN_Msk          ( 0x1ul << CLK_AHBCLK_CRCCKEN_Pos )                /*!< CLK_T::AHBCLK: CRCCKEN Mask            */

#define CLK_AHBCLK_CRPTCKEN_Pos         ( 12 )                                             /*!< CLK_T::AHBCLK: CRPTCKEN Position       */
#define CLK_AHBCLK_CRPTCKEN_Msk         ( 0x1ul << CLK_AHBCLK_CRPTCKEN_Pos )               /*!< CLK_T::AHBCLK: CRPTCKEN Mask           */

#define CLK_AHBCLK_FMCIDLE_Pos          ( 15 )                                             /*!< CLK_T::AHBCLK: FMCIDLE Position        */
#define CLK_AHBCLK_FMCIDLE_Msk          ( 0x1ul << CLK_AHBCLK_FMCIDLE_Pos )                /*!< CLK_T::AHBCLK: FMCIDLE Mask            */

#define CLK_AHBCLK_USBHCKEN_Pos         ( 16 )                                             /*!< CLK_T::AHBCLK: USBHCKEN Position       */
#define CLK_AHBCLK_USBHCKEN_Msk         ( 0x1ul << CLK_AHBCLK_USBHCKEN_Pos )               /*!< CLK_T::AHBCLK: USBHCKEN Mask           */

#define CLK_APBCLK0_WDTCKEN_Pos         ( 0 )                                              /*!< CLK_T::APBCLK0: WDTCKEN Position       */
#define CLK_APBCLK0_WDTCKEN_Msk         ( 0x1ul << CLK_APBCLK0_WDTCKEN_Pos )               /*!< CLK_T::APBCLK0: WDTCKEN Mask           */

#define CLK_APBCLK0_RTCCKEN_Pos         ( 1 )                                              /*!< CLK_T::APBCLK0: RTCCKEN Position       */
#define CLK_APBCLK0_RTCCKEN_Msk         ( 0x1ul << CLK_APBCLK0_RTCCKEN_Pos )               /*!< CLK_T::APBCLK0: RTCCKEN Mask           */

#define CLK_APBCLK0_TMR0CKEN_Pos        ( 2 )                                              /*!< CLK_T::APBCLK0: TMR0CKEN Position      */
#define CLK_APBCLK0_TMR0CKEN_Msk        ( 0x1ul << CLK_APBCLK0_TMR0CKEN_Pos )              /*!< CLK_T::APBCLK0: TMR0CKEN Mask          */

#define CLK_APBCLK0_TMR1CKEN_Pos        ( 3 )                                              /*!< CLK_T::APBCLK0: TMR1CKEN Position      */
#define CLK_APBCLK0_TMR1CKEN_Msk        ( 0x1ul << CLK_APBCLK0_TMR1CKEN_Pos )              /*!< CLK_T::APBCLK0: TMR1CKEN Mask          */

#define CLK_APBCLK0_TMR2CKEN_Pos        ( 4 )                                              /*!< CLK_T::APBCLK0: TMR2CKEN Position      */
#define CLK_APBCLK0_TMR2CKEN_Msk        ( 0x1ul << CLK_APBCLK0_TMR2CKEN_Pos )              /*!< CLK_T::APBCLK0: TMR2CKEN Mask          */

#define CLK_APBCLK0_TMR3CKEN_Pos        ( 5 )                                              /*!< CLK_T::APBCLK0: TMR3CKEN Position      */
#define CLK_APBCLK0_TMR3CKEN_Msk        ( 0x1ul << CLK_APBCLK0_TMR3CKEN_Pos )              /*!< CLK_T::APBCLK0: TMR3CKEN Mask          */

#define CLK_APBCLK0_CLKOCKEN_Pos        ( 6 )                                              /*!< CLK_T::APBCLK0: CLKOCKEN Position      */
#define CLK_APBCLK0_CLKOCKEN_Msk        ( 0x1ul << CLK_APBCLK0_CLKOCKEN_Pos )              /*!< CLK_T::APBCLK0: CLKOCKEN Mask          */

#define CLK_APBCLK0_ACMP01CKEN_Pos      ( 7 )                                              /*!< CLK_T::APBCLK0: ACMP01CKEN Position    */
#define CLK_APBCLK0_ACMP01CKEN_Msk      ( 0x1ul << CLK_APBCLK0_ACMP01CKEN_Pos )            /*!< CLK_T::APBCLK0: ACMP01CKEN Mask        */

#define CLK_APBCLK0_I2C0CKEN_Pos        ( 8 )                                              /*!< CLK_T::APBCLK0: I2C0CKEN Position      */
#define CLK_APBCLK0_I2C0CKEN_Msk        ( 0x1ul << CLK_APBCLK0_I2C0CKEN_Pos )              /*!< CLK_T::APBCLK0: I2C0CKEN Mask          */

#define CLK_APBCLK0_I2C1CKEN_Pos        ( 9 )                                              /*!< CLK_T::APBCLK0: I2C1CKEN Position      */
#define CLK_APBCLK0_I2C1CKEN_Msk        ( 0x1ul << CLK_APBCLK0_I2C1CKEN_Pos )              /*!< CLK_T::APBCLK0: I2C1CKEN Mask          */

#define CLK_APBCLK0_I2C2CKEN_Pos        ( 10 )                                             /*!< CLK_T::APBCLK0: I2C2CKEN Position      */
#define CLK_APBCLK0_I2C2CKEN_Msk        ( 0x1ul << CLK_APBCLK0_I2C2CKEN_Pos )              /*!< CLK_T::APBCLK0: I2C2CKEN Mask          */

#define CLK_APBCLK0_QSPI0CKEN_Pos       ( 12 )                                             /*!< CLK_T::APBCLK0: QSPI0CKEN Position     */
#define CLK_APBCLK0_QSPI0CKEN_Msk       ( 0x1ul << CLK_APBCLK0_QSPI0CKEN_Pos )             /*!< CLK_T::APBCLK0: QSPI0CKEN Mask         */

#define CLK_APBCLK0_SPI0CKEN_Pos        ( 13 )                                             /*!< CLK_T::APBCLK0: SPI0CKEN Position      */
#define CLK_APBCLK0_SPI0CKEN_Msk        ( 0x1ul << CLK_APBCLK0_SPI0CKEN_Pos )              /*!< CLK_T::APBCLK0: SPI0CKEN Mask          */

#define CLK_APBCLK0_SPI1CKEN_Pos        ( 14 )                                             /*!< CLK_T::APBCLK0: SPI1CKEN Position      */
#define CLK_APBCLK0_SPI1CKEN_Msk        ( 0x1ul << CLK_APBCLK0_SPI1CKEN_Pos )              /*!< CLK_T::APBCLK0: SPI1CKEN Mask          */

#define CLK_APBCLK0_SPI2CKEN_Pos        ( 15 )                                             /*!< CLK_T::APBCLK0: SPI2CKEN Position      */
#define CLK_APBCLK0_SPI2CKEN_Msk        ( 0x1ul << CLK_APBCLK0_SPI2CKEN_Pos )              /*!< CLK_T::APBCLK0: SPI2CKEN Mask          */

#define CLK_APBCLK0_UART0CKEN_Pos       ( 16 )                                             /*!< CLK_T::APBCLK0: UART0CKEN Position     */
#define CLK_APBCLK0_UART0CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART0CKEN_Pos )             /*!< CLK_T::APBCLK0: UART0CKEN Mask         */

