FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_APBCLK0_UART1CKEN_Pos       ( 17 )                                             /*!< CLK_T::APBCLK0: UART1CKEN Position     */
#define CLK_APBCLK0_UART1CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART1CKEN_Pos )             /*!< CLK_T::APBCLK0: UART1CKEN Mask         */

#define CLK_APBCLK0_UART2CKEN_Pos       ( 18 )                                             /*!< CLK_T::APBCLK0: UART2CKEN Position     */
#define CLK_APBCLK0_UART2CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART2CKEN_Pos )             /*!< CLK_T::APBCLK0: UART2CKEN Mask         */

#define CLK_APBCLK0_UART3CKEN_Pos       ( 19 )                                             /*!< CLK_T::APBCLK0: UART3CKEN Position     */
#define CLK_APBCLK0_UART3CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART3CKEN_Pos )             /*!< CLK_T::APBCLK0: UART3CKEN Mask         */

#define CLK_APBCLK0_UART4CKEN_Pos       ( 20 )                                             /*!< CLK_T::APBCLK0: UART4CKEN Position     */
#define CLK_APBCLK0_UART4CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART4CKEN_Pos )             /*!< CLK_T::APBCLK0: UART4CKEN Mask         */

#define CLK_APBCLK0_UART5CKEN_Pos       ( 21 )                                             /*!< CLK_T::APBCLK0: UART5CKEN Position     */
#define CLK_APBCLK0_UART5CKEN_Msk       ( 0x1ul << CLK_APBCLK0_UART5CKEN_Pos )             /*!< CLK_T::APBCLK0: UART5CKEN Mask         */

#define CLK_APBCLK0_CAN0CKEN_Pos        ( 24 )                                             /*!< CLK_T::APBCLK0: CAN0CKEN Position      */
#define CLK_APBCLK0_CAN0CKEN_Msk        ( 0x1ul << CLK_APBCLK0_CAN0CKEN_Pos )              /*!< CLK_T::APBCLK0: CAN0CKEN Mask          */

#define CLK_APBCLK0_OTGCKEN_Pos         ( 26 )                                             /*!< CLK_T::APBCLK0: OTGCKEN Position       */
#define CLK_APBCLK0_OTGCKEN_Msk         ( 0x1ul << CLK_APBCLK0_OTGCKEN_Pos )               /*!< CLK_T::APBCLK0: OTGCKEN Mask           */

#define CLK_APBCLK0_USBDCKEN_Pos        ( 27 )                                             /*!< CLK_T::APBCLK0: USBDCKEN Position       */
#define CLK_APBCLK0_USBDCKEN_Msk        ( 0x1ul << CLK_APBCLK0_USBDCKEN_Pos )              /*!< CLK_T::APBCLK0: USBDCKEN Mask           */

#define CLK_APBCLK0_USBDCKEN_Pos        ( 27 )                                             /*!< CLK_T::APBCLK0: USBDCKEN Position      */
#define CLK_APBCLK0_USBDCKEN_Msk        ( 0x1ul << CLK_APBCLK0_USBDCKEN_Pos )              /*!< CLK_T::APBCLK0: USBDCKEN Mask          */

#define CLK_APBCLK0_EADCCKEN_Pos        ( 28 )                                             /*!< CLK_T::APBCLK0: EADCCKEN Position      */
#define CLK_APBCLK0_EADCCKEN_Msk        ( 0x1ul << CLK_APBCLK0_EADCCKEN_Pos )              /*!< CLK_T::APBCLK0: EADCCKEN Mask          */

#define CLK_APBCLK0_I2S0CKEN_Pos        ( 29 )                                             /*!< CLK_T::APBCLK0: I2S0CKEN Position      */
#define CLK_APBCLK0_I2S0CKEN_Msk        ( 0x1ul << CLK_APBCLK0_I2S0CKEN_Pos )              /*!< CLK_T::APBCLK0: I2S0CKEN Mask          */

#define CLK_APBCLK1_SC0CKEN_Pos         ( 0 )                                              /*!< CLK_T::APBCLK1: SC0CKEN Position       */
#define CLK_APBCLK1_SC0CKEN_Msk         ( 0x1ul << CLK_APBCLK1_SC0CKEN_Pos )               /*!< CLK_T::APBCLK1: SC0CKEN Mask           */

#define CLK_APBCLK1_SC1CKEN_Pos         ( 1 )                                              /*!< CLK_T::APBCLK1: SC1CKEN Position       */
#define CLK_APBCLK1_SC1CKEN_Msk         ( 0x1ul << CLK_APBCLK1_SC1CKEN_Pos )               /*!< CLK_T::APBCLK1: SC1CKEN Mask           */

#define CLK_APBCLK1_SC2CKEN_Pos         ( 2 )                                              /*!< CLK_T::APBCLK1: SC2CKEN Position       */
#define CLK_APBCLK1_SC2CKEN_Msk         ( 0x1ul << CLK_APBCLK1_SC2CKEN_Pos )               /*!< CLK_T::APBCLK1: SC2CKEN Mask           */

#define CLK_APBCLK1_SPI3CKEN_Pos        ( 6 )                                              /*!< CLK_T::APBCLK1: SPI3CKEN Position      */
#define CLK_APBCLK1_SPI3CKEN_Msk        ( 0x1ul << CLK_APBCLK1_SPI3CKEN_Pos )              /*!< CLK_T::APBCLK1: SPI3CKEN Mask          */

#define CLK_APBCLK1_USCI0CKEN_Pos       ( 8 )                                              /*!< CLK_T::APBCLK1: USCI0CKEN Position     */
#define CLK_APBCLK1_USCI0CKEN_Msk       ( 0x1ul << CLK_APBCLK1_USCI0CKEN_Pos )             /*!< CLK_T::APBCLK1: USCI0CKEN Mask         */

#define CLK_APBCLK1_USCI1CKEN_Pos       ( 9 )                                              /*!< CLK_T::APBCLK1: USCI1CKEN Position     */
#define CLK_APBCLK1_USCI1CKEN_Msk       ( 0x1ul << CLK_APBCLK1_USCI1CKEN_Pos )             /*!< CLK_T::APBCLK1: USCI1CKEN Mask         */

#define CLK_APBCLK1_DACCKEN_Pos         ( 12 )                                             /*!< CLK_T::APBCLK1: DACCKEN Position       */
#define CLK_APBCLK1_DACCKEN_Msk         ( 0x1ul << CLK_APBCLK1_DACCKEN_Pos )               /*!< CLK_T::APBCLK1: DACCKEN Mask           */

#define CLK_APBCLK1_EPWM0CKEN_Pos       ( 16 )                                             /*!< CLK_T::APBCLK1: EPWM0CKEN Position     */
#define CLK_APBCLK1_EPWM0CKEN_Msk       ( 0x1ul << CLK_APBCLK1_EPWM0CKEN_Pos )             /*!< CLK_T::APBCLK1: EPWM0CKEN Mask         */

#define CLK_APBCLK1_EPWM1CKEN_Pos       ( 17 )                                             /*!< CLK_T::APBCLK1: EPWM1CKEN Position     */
#define CLK_APBCLK1_EPWM1CKEN_Msk       ( 0x1ul << CLK_APBCLK1_EPWM1CKEN_Pos )             /*!< CLK_T::APBCLK1: EPWM1CKEN Mask         */

#define CLK_APBCLK1_BPWM0CKEN_Pos       ( 18 )                                             /*!< CLK_T::APBCLK1: BPWM0CKEN Position     */
#define CLK_APBCLK1_BPWM0CKEN_Msk       ( 0x1ul << CLK_APBCLK1_BPWM0CKEN_Pos )             /*!< CLK_T::APBCLK1: BPWM0CKEN Mask         */

#define CLK_APBCLK1_BPWM1CKEN_Pos       ( 19 )                                             /*!< CLK_T::APBCLK1: BPWM1CKEN Position     */
#define CLK_APBCLK1_BPWM1CKEN_Msk       ( 0x1ul << CLK_APBCLK1_BPWM1CKEN_Pos )             /*!< CLK_T::APBCLK1: BPWM1CKEN Mask         */

#define CLK_APBCLK1_QEI0CKEN_Pos        ( 22 )                                             /*!< CLK_T::APBCLK1: QEI0CKEN Position      */
#define CLK_APBCLK1_QEI0CKEN_Msk        ( 0x1ul << CLK_APBCLK1_QEI0CKEN_Pos )              /*!< CLK_T::APBCLK1: QEI0CKEN Mask          */

#define CLK_APBCLK1_QEI1CKEN_Pos        ( 23 )                                             /*!< CLK_T::APBCLK1: QEI1CKEN Position      */
#define CLK_APBCLK1_QEI1CKEN_Msk        ( 0x1ul << CLK_APBCLK1_QEI1CKEN_Pos )              /*!< CLK_T::APBCLK1: QEI1CKEN Mask          */

