FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_APBCLK1_TRNGCKEN_Pos        ( 25 )                                             /*!< CLK_T::APBCLK1: TRNGCKEN Position       */
#define CLK_APBCLK1_TRNGCKEN_Msk        ( 0x1ul << CLK_APBCLK1_TRNGCKEN_Pos )              /*!< CLK_T::APBCLK1: TRNGCKEN Mask           */

#define CLK_APBCLK1_ECAP0CKEN_Pos       ( 26 )                                             /*!< CLK_T::APBCLK1: ECAP0CKEN Position     */
#define CLK_APBCLK1_ECAP0CKEN_Msk       ( 0x1ul << CLK_APBCLK1_ECAP0CKEN_Pos )             /*!< CLK_T::APBCLK1: ECAP0CKEN Mask         */

#define CLK_APBCLK1_ECAP1CKEN_Pos       ( 27 )                                             /*!< CLK_T::APBCLK1: ECAP1CKEN Position     */
#define CLK_APBCLK1_ECAP1CKEN_Msk       ( 0x1ul << CLK_APBCLK1_ECAP1CKEN_Pos )             /*!< CLK_T::APBCLK1: ECAP1CKEN Mask         */

#define CLK_CLKSEL0_HCLKSEL_Pos         ( 0 )                                              /*!< CLK_T::CLKSEL0: HCLKSEL Position       */
#define CLK_CLKSEL0_HCLKSEL_Msk         ( 0x7ul << CLK_CLKSEL0_HCLKSEL_Pos )               /*!< CLK_T::CLKSEL0: HCLKSEL Mask           */

#define CLK_CLKSEL0_STCLKSEL_Pos        ( 3 )                                              /*!< CLK_T::CLKSEL0: STCLKSEL Position      */
#define CLK_CLKSEL0_STCLKSEL_Msk        ( 0x7ul << CLK_CLKSEL0_STCLKSEL_Pos )              /*!< CLK_T::CLKSEL0: STCLKSEL Mask          */

#define CLK_CLKSEL0_USBSEL_Pos          ( 8 )                                              /*!< CLK_T::CLKSEL0: USBSEL Position        */
#define CLK_CLKSEL0_USBSEL_Msk          ( 0x1ul << CLK_CLKSEL0_USBSEL_Pos )                /*!< CLK_T::CLKSEL0: USBSEL Mask            */

#define CLK_CLKSEL0_SDH0SEL_Pos         ( 20 )                                             /*!< CLK_T::CLKSEL0: SDH0SEL Position       */
#define CLK_CLKSEL0_SDH0SEL_Msk         ( 0x3ul << CLK_CLKSEL0_SDH0SEL_Pos )               /*!< CLK_T::CLKSEL0: SDH0SEL Mask           */

#define CLK_CLKSEL1_WDTSEL_Pos          ( 0 )                                              /*!< CLK_T::CLKSEL1: WDTSEL Position        */
#define CLK_CLKSEL1_WDTSEL_Msk          ( 0x3ul << CLK_CLKSEL1_WDTSEL_Pos )                /*!< CLK_T::CLKSEL1: WDTSEL Mask            */

#define CLK_CLKSEL1_TMR0SEL_Pos         ( 8 )                                              /*!< CLK_T::CLKSEL1: TMR0SEL Position       */
#define CLK_CLKSEL1_TMR0SEL_Msk         ( 0x7ul << CLK_CLKSEL1_TMR0SEL_Pos )               /*!< CLK_T::CLKSEL1: TMR0SEL Mask           */

#define CLK_CLKSEL1_TMR1SEL_Pos         ( 12 )                                             /*!< CLK_T::CLKSEL1: TMR1SEL Position       */
#define CLK_CLKSEL1_TMR1SEL_Msk         ( 0x7ul << CLK_CLKSEL1_TMR1SEL_Pos )               /*!< CLK_T::CLKSEL1: TMR1SEL Mask           */

#define CLK_CLKSEL1_TMR2SEL_Pos         ( 16 )                                             /*!< CLK_T::CLKSEL1: TMR2SEL Position       */
#define CLK_CLKSEL1_TMR2SEL_Msk         ( 0x7ul << CLK_CLKSEL1_TMR2SEL_Pos )               /*!< CLK_T::CLKSEL1: TMR2SEL Mask           */

#define CLK_CLKSEL1_TMR3SEL_Pos         ( 20 )                                             /*!< CLK_T::CLKSEL1: TMR3SEL Position       */
#define CLK_CLKSEL1_TMR3SEL_Msk         ( 0x7ul << CLK_CLKSEL1_TMR3SEL_Pos )               /*!< CLK_T::CLKSEL1: TMR3SEL Mask           */

#define CLK_CLKSEL1_UART0SEL_Pos        ( 24 )                                             /*!< CLK_T::CLKSEL1: UART0SEL Position      */
#define CLK_CLKSEL1_UART0SEL_Msk        ( 0x3ul << CLK_CLKSEL1_UART0SEL_Pos )              /*!< CLK_T::CLKSEL1: UART0SEL Mask          */

#define CLK_CLKSEL1_UART1SEL_Pos        ( 26 )                                             /*!< CLK_T::CLKSEL1: UART1SEL Position      */
#define CLK_CLKSEL1_UART1SEL_Msk        ( 0x3ul << CLK_CLKSEL1_UART1SEL_Pos )              /*!< CLK_T::CLKSEL1: UART1SEL Mask          */

#define CLK_CLKSEL1_CLKOSEL_Pos         ( 28 )                                             /*!< CLK_T::CLKSEL1: CLKOSEL Position       */
#define CLK_CLKSEL1_CLKOSEL_Msk         ( 0x3ul << CLK_CLKSEL1_CLKOSEL_Pos )               /*!< CLK_T::CLKSEL1: CLKOSEL Mask           */

#define CLK_CLKSEL1_WWDTSEL_Pos         ( 30 )                                             /*!< CLK_T::CLKSEL1: WWDTSEL Position       */
#define CLK_CLKSEL1_WWDTSEL_Msk         ( 0x3ul << CLK_CLKSEL1_WWDTSEL_Pos )               /*!< CLK_T::CLKSEL1: WWDTSEL Mask           */

#define CLK_CLKSEL2_EPWM0SEL_Pos        ( 0 )                                              /*!< CLK_T::CLKSEL2: EPWM0SEL Position      */
#define CLK_CLKSEL2_EPWM0SEL_Msk        ( 0x1ul << CLK_CLKSEL2_EPWM0SEL_Pos )              /*!< CLK_T::CLKSEL2: EPWM0SEL Mask          */

#define CLK_CLKSEL2_EPWM1SEL_Pos        ( 1 )                                              /*!< CLK_T::CLKSEL2: EPWM1SEL Position      */
#define CLK_CLKSEL2_EPWM1SEL_Msk        ( 0x1ul << CLK_CLKSEL2_EPWM1SEL_Pos )              /*!< CLK_T::CLKSEL2: EPWM1SEL Mask          */

#define CLK_CLKSEL2_QSPI0SEL_Pos        ( 2 )                                              /*!< CLK_T::CLKSEL2: QSPI0SEL Position      */
#define CLK_CLKSEL2_QSPI0SEL_Msk        ( 0x3ul << CLK_CLKSEL2_QSPI0SEL_Pos )              /*!< CLK_T::CLKSEL2: QSPI0SEL Mask          */

#define CLK_CLKSEL2_SPI0SEL_Pos         ( 4 )                                              /*!< CLK_T::CLKSEL2: SPI0SEL Position       */
#define CLK_CLKSEL2_SPI0SEL_Msk         ( 0x3ul << CLK_CLKSEL2_SPI0SEL_Pos )               /*!< CLK_T::CLKSEL2: SPI0SEL Mask           */

#define CLK_CLKSEL2_SPI1SEL_Pos         ( 6 )                                              /*!< CLK_T::CLKSEL2: SPI1SEL Position       */
#define CLK_CLKSEL2_SPI1SEL_Msk         ( 0x3ul << CLK_CLKSEL2_SPI1SEL_Pos )               /*!< CLK_T::CLKSEL2: SPI1SEL Mask           */

#define CLK_CLKSEL2_SPI2SEL_Pos         ( 10 )                                             /*!< CLK_T::CLKSEL2: SPI2SEL Position       */
#define CLK_CLKSEL2_SPI2SEL_Msk         ( 0x3ul << CLK_CLKSEL2_SPI2SEL_Pos )               /*!< CLK_T::CLKSEL2: SPI2SEL Mask           */

#define CLK_CLKSEL2_BPWM0SEL_Pos        ( 8 )                                              /*!< CLK_T::CLKSEL2: BPWM0SEL Position      */
#define CLK_CLKSEL2_BPWM0SEL_Msk        ( 0x1ul << CLK_CLKSEL2_BPWM0SEL_Pos )              /*!< CLK_T::CLKSEL2: BPWM0SEL Mask          */

#define CLK_CLKSEL2_BPWM1SEL_Pos        ( 9 )                                              /*!< CLK_T::CLKSEL2: BPWM1SEL Position      */
#define CLK_CLKSEL2_BPWM1SEL_Msk        ( 0x1ul << CLK_CLKSEL2_BPWM1SEL_Pos )              /*!< CLK_T::CLKSEL2: BPWM1SEL Mask          */

#define CLK_CLKSEL2_SPI3SEL_Pos         ( 12 )                                             /*!< CLK_T::CLKSEL2: SPI3SEL Position       */
#define CLK_CLKSEL2_SPI3SEL_Msk         ( 0x3ul << CLK_CLKSEL2_SPI3SEL_Pos )               /*!< CLK_T::CLKSEL2: SPI3SEL Mask           */

#define CLK_CLKSEL3_SC0SEL_Pos          ( 0 )                                              /*!< CLK_T::CLKSEL3: SC0SEL Position        */
#define CLK_CLKSEL3_SC0SEL_Msk          ( 0x3ul << CLK_CLKSEL3_SC0SEL_Pos )                /*!< CLK_T::CLKSEL3: SC0SEL Mask            */

#define CLK_CLKSEL3_SC1SEL_Pos          ( 2 )                                              /*!< CLK_T::CLKSEL3: SC1SEL Position        */
#define CLK_CLKSEL3_SC1SEL_Msk          ( 0x3ul << CLK_CLKSEL3_SC1SEL_Pos )                /*!< CLK_T::CLKSEL3: SC1SEL Mask            */

