FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_CLKSEL3_SC2SEL_Pos          ( 4 )                                              /*!< CLK_T::CLKSEL3: SC2SEL Position        */
#define CLK_CLKSEL3_SC2SEL_Msk          ( 0x3ul << CLK_CLKSEL3_SC2SEL_Pos )                /*!< CLK_T::CLKSEL3: SC2SEL Mask            */

#define CLK_CLKSEL3_RTCSEL_Pos          ( 8 )                                              /*!< CLK_T::CLKSEL3: RTCSEL Position        */
#define CLK_CLKSEL3_RTCSEL_Msk          ( 0x3ul << CLK_CLKSEL3_RTCSEL_Pos )                /*!< CLK_T::CLKSEL3: RTCSEL Mask            */

#define CLK_CLKSEL3_I2S0SEL_Pos         ( 16 )                                             /*!< CLK_T::CLKSEL3: I2S0SEL Position       */
#define CLK_CLKSEL3_I2S0SEL_Msk         ( 0x3ul << CLK_CLKSEL3_I2S0SEL_Pos )               /*!< CLK_T::CLKSEL3: I2S0SEL Mask           */

#define CLK_CLKSEL3_UART2SEL_Pos        ( 24 )                                             /*!< CLK_T::CLKSEL3: UART2SEL Position      */
#define CLK_CLKSEL3_UART2SEL_Msk        ( 0x3ul << CLK_CLKSEL3_UART2SEL_Pos )              /*!< CLK_T::CLKSEL3: UART2SEL Mask          */

#define CLK_CLKSEL3_UART3SEL_Pos        ( 26 )                                             /*!< CLK_T::CLKSEL3: UART3SEL Position      */
#define CLK_CLKSEL3_UART3SEL_Msk        ( 0x3ul << CLK_CLKSEL3_UART3SEL_Pos )              /*!< CLK_T::CLKSEL3: UART3SEL Mask          */

#define CLK_CLKSEL3_UART4SEL_Pos        ( 28 )                                             /*!< CLK_T::CLKSEL3: UART4SEL Position      */
#define CLK_CLKSEL3_UART4SEL_Msk        ( 0x3ul << CLK_CLKSEL3_UART4SEL_Pos )              /*!< CLK_T::CLKSEL3: UART4SEL Mask          */

#define CLK_CLKSEL3_UART5SEL_Pos        ( 30 )                                             /*!< CLK_T::CLKSEL3: UART5SEL Position      */
#define CLK_CLKSEL3_UART5SEL_Msk        ( 0x3ul << CLK_CLKSEL3_UART5SEL_Pos )              /*!< CLK_T::CLKSEL3: UART5SEL Mask          */

#define CLK_CLKDIV0_HCLKDIV_Pos         ( 0 )                                              /*!< CLK_T::CLKDIV0: HCLKDIV Position       */
#define CLK_CLKDIV0_HCLKDIV_Msk         ( 0xful << CLK_CLKDIV0_HCLKDIV_Pos )               /*!< CLK_T::CLKDIV0: HCLKDIV Mask           */

#define CLK_CLKDIV0_USBDIV_Pos          ( 4 )                                              /*!< CLK_T::CLKDIV0: USBDIV Position        */
#define CLK_CLKDIV0_USBDIV_Msk          ( 0xful << CLK_CLKDIV0_USBDIV_Pos )                /*!< CLK_T::CLKDIV0: USBDIV Mask            */

#define CLK_CLKDIV0_UART0DIV_Pos        ( 8 )                                              /*!< CLK_T::CLKDIV0: UART0DIV Position      */
#define CLK_CLKDIV0_UART0DIV_Msk        ( 0xful << CLK_CLKDIV0_UART0DIV_Pos )              /*!< CLK_T::CLKDIV0: UART0DIV Mask          */

#define CLK_CLKDIV0_UART1DIV_Pos        ( 12 )                                             /*!< CLK_T::CLKDIV0: UART1DIV Position      */
#define CLK_CLKDIV0_UART1DIV_Msk        ( 0xful << CLK_CLKDIV0_UART1DIV_Pos )              /*!< CLK_T::CLKDIV0: UART1DIV Mask          */

#define CLK_CLKDIV0_EADCDIV_Pos         ( 16 )                                             /*!< CLK_T::CLKDIV0: EADCDIV Position       */
#define CLK_CLKDIV0_EADCDIV_Msk         ( 0xfful << CLK_CLKDIV0_EADCDIV_Pos )              /*!< CLK_T::CLKDIV0: EADCDIV Mask           */

#define CLK_CLKDIV0_SDH0DIV_Pos         ( 24 )                                             /*!< CLK_T::CLKDIV0: SDH0DIV Position       */
#define CLK_CLKDIV0_SDH0DIV_Msk         ( 0xfful << CLK_CLKDIV0_SDH0DIV_Pos )              /*!< CLK_T::CLKDIV0: SDH0DIV Mask           */

#define CLK_CLKDIV1_SC0DIV_Pos          ( 0 )                                              /*!< CLK_T::CLKDIV1: SC0DIV Position        */
#define CLK_CLKDIV1_SC0DIV_Msk          ( 0xfful << CLK_CLKDIV1_SC0DIV_Pos )               /*!< CLK_T::CLKDIV1: SC0DIV Mask            */

#define CLK_CLKDIV1_SC1DIV_Pos          ( 8 )                                              /*!< CLK_T::CLKDIV1: SC1DIV Position        */
#define CLK_CLKDIV1_SC1DIV_Msk          ( 0xfful << CLK_CLKDIV1_SC1DIV_Pos )               /*!< CLK_T::CLKDIV1: SC1DIV Mask            */

#define CLK_CLKDIV1_SC2DIV_Pos          ( 16 )                                             /*!< CLK_T::CLKDIV1: SC2DIV Position        */
#define CLK_CLKDIV1_SC2DIV_Msk          ( 0xfful << CLK_CLKDIV1_SC2DIV_Pos )               /*!< CLK_T::CLKDIV1: SC2DIV Mask            */

#define CLK_CLKDIV4_UART2DIV_Pos        ( 0 )                                              /*!< CLK_T::CLKDIV4: UART2DIV Position      */
#define CLK_CLKDIV4_UART2DIV_Msk        ( 0xful << CLK_CLKDIV4_UART2DIV_Pos )              /*!< CLK_T::CLKDIV4: UART2DIV Mask          */

#define CLK_CLKDIV4_UART3DIV_Pos        ( 4 )                                              /*!< CLK_T::CLKDIV4: UART3DIV Position      */
#define CLK_CLKDIV4_UART3DIV_Msk        ( 0xful << CLK_CLKDIV4_UART3DIV_Pos )              /*!< CLK_T::CLKDIV4: UART3DIV Mask          */

#define CLK_CLKDIV4_UART4DIV_Pos        ( 8 )                                              /*!< CLK_T::CLKDIV4: UART4DIV Position      */
#define CLK_CLKDIV4_UART4DIV_Msk        ( 0xful << CLK_CLKDIV4_UART4DIV_Pos )              /*!< CLK_T::CLKDIV4: UART4DIV Mask          */

#define CLK_CLKDIV4_UART5DIV_Pos        ( 12 )                                             /*!< CLK_T::CLKDIV4: UART5DIV Position      */
#define CLK_CLKDIV4_UART5DIV_Msk        ( 0xful << CLK_CLKDIV4_UART5DIV_Pos )              /*!< CLK_T::CLKDIV4: UART5DIV Mask          */

#define CLK_PCLKDIV_APB0DIV_Pos         ( 0 )                                              /*!< CLK_T::PCLKDIV: APB0DIV Position       */
#define CLK_PCLKDIV_APB0DIV_Msk         ( 0x7ul << CLK_PCLKDIV_APB0DIV_Pos )               /*!< CLK_T::PCLKDIV: APB0DIV Mask           */

#define CLK_PCLKDIV_APB1DIV_Pos         ( 4 )                                              /*!< CLK_T::PCLKDIV: APB1DIV Position       */
#define CLK_PCLKDIV_APB1DIV_Msk         ( 0x7ul << CLK_PCLKDIV_APB1DIV_Pos )               /*!< CLK_T::PCLKDIV: APB1DIV Mask           */

