FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_PLLCTL_FBDIV_Pos            ( 0 )                                              /*!< CLK_T::PLLCTL: FBDIV Position          */
#define CLK_PLLCTL_FBDIV_Msk            ( 0x1fful << CLK_PLLCTL_FBDIV_Pos )                /*!< CLK_T::PLLCTL: FBDIV Mask              */

#define CLK_PLLCTL_INDIV_Pos            ( 9 )                                              /*!< CLK_T::PLLCTL: INDIV Position          */
#define CLK_PLLCTL_INDIV_Msk            ( 0x1ful << CLK_PLLCTL_INDIV_Pos )                 /*!< CLK_T::PLLCTL: INDIV Mask              */

#define CLK_PLLCTL_OUTDIV_Pos           ( 14 )                                             /*!< CLK_T::PLLCTL: OUTDIV Position         */
#define CLK_PLLCTL_OUTDIV_Msk           ( 0x3ul << CLK_PLLCTL_OUTDIV_Pos )                 /*!< CLK_T::PLLCTL: OUTDIV Mask             */

#define CLK_PLLCTL_PD_Pos               ( 16 )                                             /*!< CLK_T::PLLCTL: PD Position             */
#define CLK_PLLCTL_PD_Msk               ( 0x1ul << CLK_PLLCTL_PD_Pos )                     /*!< CLK_T::PLLCTL: PD Mask                 */

#define CLK_PLLCTL_BP_Pos               ( 17 )                                             /*!< CLK_T::PLLCTL: BP Position             */
#define CLK_PLLCTL_BP_Msk               ( 0x1ul << CLK_PLLCTL_BP_Pos )                     /*!< CLK_T::PLLCTL: BP Mask                 */

#define CLK_PLLCTL_OE_Pos               ( 18 )                                             /*!< CLK_T::PLLCTL: OE Position             */
#define CLK_PLLCTL_OE_Msk               ( 0x1ul << CLK_PLLCTL_OE_Pos )                     /*!< CLK_T::PLLCTL: OE Mask                 */

#define CLK_PLLCTL_PLLSRC_Pos           ( 19 )                                             /*!< CLK_T::PLLCTL: PLLSRC Position         */
#define CLK_PLLCTL_PLLSRC_Msk           ( 0x1ul << CLK_PLLCTL_PLLSRC_Pos )                 /*!< CLK_T::PLLCTL: PLLSRC Mask             */

#define CLK_PLLCTL_STBSEL_Pos           ( 23 )                                             /*!< CLK_T::PLLCTL: STBSEL Position         */
#define CLK_PLLCTL_STBSEL_Msk           ( 0x1ul << CLK_PLLCTL_STBSEL_Pos )                 /*!< CLK_T::PLLCTL: STBSEL Mask             */

#define CLK_STATUS_HXTSTB_Pos           ( 0 )                                              /*!< CLK_T::STATUS: HXTSTB Position         */
#define CLK_STATUS_HXTSTB_Msk           ( 0x1ul << CLK_STATUS_HXTSTB_Pos )                 /*!< CLK_T::STATUS: HXTSTB Mask             */

#define CLK_STATUS_LXTSTB_Pos           ( 1 )                                              /*!< CLK_T::STATUS: LXTSTB Position         */
#define CLK_STATUS_LXTSTB_Msk           ( 0x1ul << CLK_STATUS_LXTSTB_Pos )                 /*!< CLK_T::STATUS: LXTSTB Mask             */

#define CLK_STATUS_PLLSTB_Pos           ( 2 )                                              /*!< CLK_T::STATUS: PLLSTB Position         */
#define CLK_STATUS_PLLSTB_Msk           ( 0x1ul << CLK_STATUS_PLLSTB_Pos )                 /*!< CLK_T::STATUS: PLLSTB Mask             */

#define CLK_STATUS_LIRCSTB_Pos          ( 3 )                                              /*!< CLK_T::STATUS: LIRCSTB Position        */
#define CLK_STATUS_LIRCSTB_Msk          ( 0x1ul << CLK_STATUS_LIRCSTB_Pos )                /*!< CLK_T::STATUS: LIRCSTB Mask            */

#define CLK_STATUS_HIRCSTB_Pos          ( 4 )                                              /*!< CLK_T::STATUS: HIRCSTB Position        */
#define CLK_STATUS_HIRCSTB_Msk          ( 0x1ul << CLK_STATUS_HIRCSTB_Pos )                /*!< CLK_T::STATUS: HIRCSTB Mask            */

#define CLK_STATUS_HIRC48STB_Pos        ( 6 )                                              /*!< CLK_T::STATUS: HIRC48STB Position      */
#define CLK_STATUS_HIRC48STB_Msk        ( 0x1ul << CLK_STATUS_HIRC48STB_Pos )              /*!< CLK_T::STATUS: HIRC48STB Mask          */

#define CLK_STATUS_CLKSFAIL_Pos         ( 7 )                                              /*!< CLK_T::STATUS: CLKSFAIL Position       */
#define CLK_STATUS_CLKSFAIL_Msk         ( 0x1ul << CLK_STATUS_CLKSFAIL_Pos )               /*!< CLK_T::STATUS: CLKSFAIL Mask           */

#define CLK_STATUS_EXTLXTSTB_Pos        ( 8 )                                              /*!< CLK_T::STATUS: EXTLXTSTB Position      */
#define CLK_STATUS_EXTLXTSTB_Msk        ( 0x1ul << CLK_STATUS_EXTLXTSTB_Pos )              /*!< CLK_T::STATUS: EXTLXTSTB Mask          */

#define CLK_STATUS_LIRC32STB_Pos        ( 9 )                                              /*!< CLK_T::STATUS: LIRC32STB Position      */
#define CLK_STATUS_LIRC32STB_Msk        ( 0x1ul << CLK_STATUS_LIRC32STB_Pos )              /*!< CLK_T::STATUS: LIRC32STB Mask          */

#define CLK_CLKOCTL_FREQSEL_Pos         ( 0 )                                              /*!< CLK_T::CLKOCTL: FREQSEL Position       */
#define CLK_CLKOCTL_FREQSEL_Msk         ( 0xful << CLK_CLKOCTL_FREQSEL_Pos )               /*!< CLK_T::CLKOCTL: FREQSEL Mask           */

#define CLK_CLKOCTL_CLKOEN_Pos          ( 4 )                                              /*!< CLK_T::CLKOCTL: CLKOEN Position        */
#define CLK_CLKOCTL_CLKOEN_Msk          ( 0x1ul << CLK_CLKOCTL_CLKOEN_Pos )                /*!< CLK_T::CLKOCTL: CLKOEN Mask            */

#define CLK_CLKOCTL_DIV1EN_Pos          ( 5 )                                              /*!< CLK_T::CLKOCTL: DIV1EN Position        */
#define CLK_CLKOCTL_DIV1EN_Msk          ( 0x1ul << CLK_CLKOCTL_DIV1EN_Pos )                /*!< CLK_T::CLKOCTL: DIV1EN Mask            */

#define CLK_CLKOCTL_CLK1HZEN_Pos        ( 6 )                                              /*!< CLK_T::CLKOCTL: CLK1HZEN Position      */
#define CLK_CLKOCTL_CLK1HZEN_Msk        ( 0x1ul << CLK_CLKOCTL_CLK1HZEN_Pos )              /*!< CLK_T::CLKOCTL: CLK1HZEN Mask          */

#define CLK_CLKDCTL_HXTFDEN_Pos         ( 4 )                                              /*!< CLK_T::CLKDCTL: HXTFDEN Position       */
#define CLK_CLKDCTL_HXTFDEN_Msk         ( 0x1ul << CLK_CLKDCTL_HXTFDEN_Pos )               /*!< CLK_T::CLKDCTL: HXTFDEN Mask           */

#define CLK_CLKDCTL_HXTFIEN_Pos         ( 5 )                                              /*!< CLK_T::CLKDCTL: HXTFIEN Position       */
#define CLK_CLKDCTL_HXTFIEN_Msk         ( 0x1ul << CLK_CLKDCTL_HXTFIEN_Pos )               /*!< CLK_T::CLKDCTL: HXTFIEN Mask           */

