FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_CLKDCTL_LXTFDEN_Pos         ( 12 )                                             /*!< CLK_T::CLKDCTL: LXTFDEN Position       */
#define CLK_CLKDCTL_LXTFDEN_Msk         ( 0x1ul << CLK_CLKDCTL_LXTFDEN_Pos )               /*!< CLK_T::CLKDCTL: LXTFDEN Mask           */

#define CLK_CLKDCTL_LXTFIEN_Pos         ( 13 )                                             /*!< CLK_T::CLKDCTL: LXTFIEN Position       */
#define CLK_CLKDCTL_LXTFIEN_Msk         ( 0x1ul << CLK_CLKDCTL_LXTFIEN_Pos )               /*!< CLK_T::CLKDCTL: LXTFIEN Mask           */

#define CLK_CLKDCTL_HXTFQDEN_Pos        ( 16 )                                             /*!< CLK_T::CLKDCTL: HXTFQDEN Position      */
#define CLK_CLKDCTL_HXTFQDEN_Msk        ( 0x1ul << CLK_CLKDCTL_HXTFQDEN_Pos )              /*!< CLK_T::CLKDCTL: HXTFQDEN Mask          */

#define CLK_CLKDCTL_HXTFQIEN_Pos        ( 17 )                                             /*!< CLK_T::CLKDCTL: HXTFQIEN Position      */
#define CLK_CLKDCTL_HXTFQIEN_Msk        ( 0x1ul << CLK_CLKDCTL_HXTFQIEN_Pos )              /*!< CLK_T::CLKDCTL: HXTFQIEN Mask          */

#define CLK_CLKDSTS_HXTFIF_Pos          ( 0 )                                              /*!< CLK_T::CLKDSTS: HXTFIF Position        */
#define CLK_CLKDSTS_HXTFIF_Msk          ( 0x1ul << CLK_CLKDSTS_HXTFIF_Pos )                /*!< CLK_T::CLKDSTS: HXTFIF Mask            */

#define CLK_CLKDSTS_LXTFIF_Pos          ( 1 )                                              /*!< CLK_T::CLKDSTS: LXTFIF Position        */
#define CLK_CLKDSTS_LXTFIF_Msk          ( 0x1ul << CLK_CLKDSTS_LXTFIF_Pos )                /*!< CLK_T::CLKDSTS: LXTFIF Mask            */

#define CLK_CLKDSTS_HXTFQIF_Pos         ( 8 )                                              /*!< CLK_T::CLKDSTS: HXTFQIF Position       */
#define CLK_CLKDSTS_HXTFQIF_Msk         ( 0x1ul << CLK_CLKDSTS_HXTFQIF_Pos )               /*!< CLK_T::CLKDSTS: HXTFQIF Mask           */

#define CLK_CDUPB_UPERBD_Pos            ( 0 )                                              /*!< CLK_T::CDUPB: UPERBD Position          */
#define CLK_CDUPB_UPERBD_Msk            ( 0x3fful << CLK_CDUPB_UPERBD_Pos )                /*!< CLK_T::CDUPB: UPERBD Mask              */

#define CLK_CDLOWB_LOWERBD_Pos          ( 0 )                                              /*!< CLK_T::CDLOWB: LOWERBD Position        */
#define CLK_CDLOWB_LOWERBD_Msk          ( 0x3fful << CLK_CDLOWB_LOWERBD_Pos )              /*!< CLK_T::CDLOWB: LOWERBD Mask            */

#define CLK_PMUCTL_PDMSEL_Pos           ( 0 )                                              /*!< CLK_T::PMUCTL: PDMSEL Position         */
#define CLK_PMUCTL_PDMSEL_Msk           ( 0x7ul << CLK_PMUCTL_PDMSEL_Pos )                 /*!< CLK_T::PMUCTL: PDMSEL Mask             */

#define CLK_PMUCTL_WKTMREN_Pos          ( 8 )                                              /*!< CLK_T::PMUCTL: WKTMREN Position        */
#define CLK_PMUCTL_WKTMREN_Msk          ( 0x1ul << CLK_PMUCTL_WKTMREN_Pos )                /*!< CLK_T::PMUCTL: WKTMREN Mask            */

#define CLK_PMUCTL_WKTMRIS_Pos          ( 9 )                                              /*!< CLK_T::PMUCTL: WKTMRIS Position        */
#define CLK_PMUCTL_WKTMRIS_Msk          ( 0x7ul << CLK_PMUCTL_WKTMRIS_Pos )                /*!< CLK_T::PMUCTL: WKTMRIS Mask            */

#define CLK_PMUCTL_WKPINEN_Pos          ( 16 )                                             /*!< CLK_T::PMUCTL: WKPINEN Position        */
#define CLK_PMUCTL_WKPINEN_Msk          ( 0x3ul << CLK_PMUCTL_WKPINEN_Pos )                /*!< CLK_T::PMUCTL: WKPINEN Mask            */

#define CLK_PMUCTL_ACMPSPWK_Pos         ( 18 )                                             /*!< CLK_T::PMUCTL: ACMPSPWK Position       */
#define CLK_PMUCTL_ACMPSPWK_Msk         ( 0x1ul << CLK_PMUCTL_ACMPSPWK_Pos )               /*!< CLK_T::PMUCTL: ACMPSPWK Mask           */

#define CLK_PMUCTL_RTCWKEN_Pos          ( 23 )                                             /*!< CLK_T::PMUCTL: RTCWKEN Position        */
#define CLK_PMUCTL_RTCWKEN_Msk          ( 0x1ul << CLK_PMUCTL_RTCWKEN_Pos )                /*!< CLK_T::PMUCTL: RTCWKEN Mask            */

#define CLK_PMUSTS_PINWK_Pos            ( 0 )                                              /*!< CLK_T::PMUSTS: PINWK Position          */
#define CLK_PMUSTS_PINWK_Msk            ( 0x1ul << CLK_PMUSTS_PINWK_Pos )                  /*!< CLK_T::PMUSTS: PINWK Mask              */

#define CLK_PMUSTS_TMRWK_Pos            ( 1 )                                              /*!< CLK_T::PMUSTS: TMRWK Position          */
#define CLK_PMUSTS_TMRWK_Msk            ( 0x1ul << CLK_PMUSTS_TMRWK_Pos )                  /*!< CLK_T::PMUSTS: TMRWK Mask              */

#define CLK_PMUSTS_RTCWK_Pos            ( 2 )                                              /*!< CLK_T::PMUSTS: RTCWK Position          */
#define CLK_PMUSTS_RTCWK_Msk            ( 0x1ul << CLK_PMUSTS_RTCWK_Pos )                  /*!< CLK_T::PMUSTS: RTCWK Mask              */

#define CLK_PMUSTS_GPAWK_Pos            ( 8 )                                              /*!< CLK_T::PMUSTS: GPAWK Position          */
#define CLK_PMUSTS_GPAWK_Msk            ( 0x1ul << CLK_PMUSTS_GPAWK_Pos )                  /*!< CLK_T::PMUSTS: GPAWK Mask              */

#define CLK_PMUSTS_GPBWK_Pos            ( 9 )                                              /*!< CLK_T::PMUSTS: GPBWK Position          */
#define CLK_PMUSTS_GPBWK_Msk            ( 0x1ul << CLK_PMUSTS_GPBWK_Pos )                  /*!< CLK_T::PMUSTS: GPBWK Mask              */

#define CLK_PMUSTS_GPCWK_Pos            ( 10 )                                             /*!< CLK_T::PMUSTS: GPCWK Position          */
#define CLK_PMUSTS_GPCWK_Msk            ( 0x1ul << CLK_PMUSTS_GPCWK_Pos )                  /*!< CLK_T::PMUSTS: GPCWK Mask              */

#define CLK_PMUSTS_GPDWK_Pos            ( 11 )                                             /*!< CLK_T::PMUSTS: GPDWK Position          */
#define CLK_PMUSTS_GPDWK_Msk            ( 0x1ul << CLK_PMUSTS_GPDWK_Pos )                  /*!< CLK_T::PMUSTS: GPDWK Mask              */

