FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/clk_reg.h
#define CLK_PMUSTS_LVRWK_Pos            ( 12 )                                             /*!< CLK_T::PMUSTS: LVRWK Position          */
#define CLK_PMUSTS_LVRWK_Msk            ( 0x1ul << CLK_PMUSTS_LVRWK_Pos )                  /*!< CLK_T::PMUSTS: LVRWK Mask              */

#define CLK_PMUSTS_BODWK_Pos            ( 13 )                                             /*!< CLK_T::PMUSTS: BODWK Position          */
#define CLK_PMUSTS_BODWK_Msk            ( 0x1ul << CLK_PMUSTS_BODWK_Pos )                  /*!< CLK_T::PMUSTS: BODWK Mask              */

#define CLK_PMUSTS_ACMPWK_Pos           ( 14 )                                             /*!< CLK_T::PMUSTS: ACMPWK Position         */
#define CLK_PMUSTS_ACMPWK_Msk           ( 0x1ul << CLK_PMUSTS_ACMPWK_Pos )                 /*!< CLK_T::PMUSTS: ACMPWK Mask             */

#define CLK_PMUSTS_CLRWK_Pos            ( 31 )                                             /*!< CLK_T::PMUSTS: CLRWK Position          */
#define CLK_PMUSTS_CLRWK_Msk            ( 0x1ul << CLK_PMUSTS_CLRWK_Pos )                  /*!< CLK_T::PMUSTS: CLRWK Mask              */

#define CLK_SWKDBCTL_SWKDBCLKSEL_Pos    ( 0 )                                              /*!< CLK_T::SWKDBCTL: SWKDBCLKSEL Position  */
#define CLK_SWKDBCTL_SWKDBCLKSEL_Msk    ( 0xFul << CLK_SWKDBCTL_SWKDBCLKSEL_Pos )          /*!< CLK_T::SWKDBCTL: SWKDBCLKSEL Mask      */

#define CLK_PASWKCTL_WKEN_Pos           ( 0 )                                              /*!< CLK_T::PASWKCTL: WKEN Position         */
#define CLK_PASWKCTL_WKEN_Msk           ( 0x1ul << CLK_PASWKCTL_WKEN_Pos )                 /*!< CLK_T::PASWKCTL: WKEN Mask             */

#define CLK_PASWKCTL_PRWKEN_Pos         ( 1 )                                              /*!< CLK_T::PASWKCTL: PRWKEN Position       */
#define CLK_PASWKCTL_PRWKEN_Msk         ( 0x1ul << CLK_PASWKCTL_PRWKEN_Pos )               /*!< CLK_T::PASWKCTL: PRWKEN Mask           */

#define CLK_PASWKCTL_PFWKEN_Pos         ( 2 )                                              /*!< CLK_T::PASWKCTL: PFWKEN Position       */
#define CLK_PASWKCTL_PFWKEN_Msk         ( 0x1ul << CLK_PASWKCTL_PFWKEN_Pos )               /*!< CLK_T::PASWKCTL: PFWKEN Mask           */

#define CLK_PASWKCTL_WKPSEL_Pos         ( 4 )                                              /*!< CLK_T::PASWKCTL: WKPSEL Position       */
#define CLK_PASWKCTL_WKPSEL_Msk         ( 0xful << CLK_PASWKCTL_WKPSEL_Pos )               /*!< CLK_T::PASWKCTL: WKPSEL Mask           */

#define CLK_PASWKCTL_DBEN_Pos           ( 8 )                                              /*!< CLK_T::PASWKCTL: DBEN Position         */
#define CLK_PASWKCTL_DBEN_Msk           ( 0x1ul << CLK_PASWKCTL_DBEN_Pos )                 /*!< CLK_T::PASWKCTL: DBEN Mask             */

#define CLK_PBSWKCTL_WKEN_Pos           ( 0 )                                              /*!< CLK_T::PBSWKCTL: WKEN Position         */
#define CLK_PBSWKCTL_WKEN_Msk           ( 0x1ul << CLK_PBSWKCTL_WKEN_Pos )                 /*!< CLK_T::PBSWKCTL: WKEN Mask             */

#define CLK_PBSWKCTL_PRWKEN_Pos         ( 1 )                                              /*!< CLK_T::PBSWKCTL: PRWKEN Position       */
#define CLK_PBSWKCTL_PRWKEN_Msk         ( 0x1ul << CLK_PBSWKCTL_PRWKEN_Pos )               /*!< CLK_T::PBSWKCTL: PRWKEN Mask           */

#define CLK_PBSWKCTL_PFWKEN_Pos         ( 2 )                                              /*!< CLK_T::PBSWKCTL: PFWKEN Position       */
#define CLK_PBSWKCTL_PFWKEN_Msk         ( 0x1ul << CLK_PBSWKCTL_PFWKEN_Pos )               /*!< CLK_T::PBSWKCTL: PFWKEN Mask           */

#define CLK_PBSWKCTL_WKPSEL_Pos         ( 4 )                                              /*!< CLK_T::PBSWKCTL: WKPSEL Position       */
#define CLK_PBSWKCTL_WKPSEL_Msk         ( 0xful << CLK_PBSWKCTL_WKPSEL_Pos )               /*!< CLK_T::PBSWKCTL: WKPSEL Mask           */

#define CLK_PBSWKCTL_DBEN_Pos           ( 8 )                                              /*!< CLK_T::PBSWKCTL: DBEN Position         */
#define CLK_PBSWKCTL_DBEN_Msk           ( 0x1ul << CLK_PBSWKCTL_DBEN_Pos )                 /*!< CLK_T::PBSWKCTL: DBEN Mask             */

#define CLK_PCSWKCTL_WKEN_Pos           ( 0 )                                              /*!< CLK_T::PCSWKCTL: WKEN Position         */
#define CLK_PCSWKCTL_WKEN_Msk           ( 0x1ul << CLK_PCSWKCTL_WKEN_Pos )                 /*!< CLK_T::PCSWKCTL: WKEN Mask             */

#define CLK_PCSWKCTL_PRWKEN_Pos         ( 1 )                                              /*!< CLK_T::PCSWKCTL: PRWKEN Position       */
#define CLK_PCSWKCTL_PRWKEN_Msk         ( 0x1ul << CLK_PCSWKCTL_PRWKEN_Pos )               /*!< CLK_T::PCSWKCTL: PRWKEN Mask           */

#define CLK_PCSWKCTL_PFWKEN_Pos         ( 2 )                                              /*!< CLK_T::PCSWKCTL: PFWKEN Position       */
#define CLK_PCSWKCTL_PFWKEN_Msk         ( 0x1ul << CLK_PCSWKCTL_PFWKEN_Pos )               /*!< CLK_T::PCSWKCTL: PFWKEN Mask           */

#define CLK_PCSWKCTL_WKPSEL_Pos         ( 4 )                                              /*!< CLK_T::PCSWKCTL: WKPSEL Position       */
#define CLK_PCSWKCTL_WKPSEL_Msk         ( 0xful << CLK_PCSWKCTL_WKPSEL_Pos )               /*!< CLK_T::PCSWKCTL: WKPSEL Mask           */

#define CLK_PCSWKCTL_DBEN_Pos           ( 8 )                                              /*!< CLK_T::PCSWKCTL: DBEN Position         */
#define CLK_PCSWKCTL_DBEN_Msk           ( 0x1ul << CLK_PCSWKCTL_DBEN_Pos )                 /*!< CLK_T::PCSWKCTL: DBEN Mask             */

#define CLK_PDSWKCTL_WKEN_Pos           ( 0 )                                              /*!< CLK_T::PDSWKCTL: WKEN Position         */
#define CLK_PDSWKCTL_WKEN_Msk           ( 0x1ul << CLK_PDSWKCTL_WKEN_Pos )                 /*!< CLK_T::PDSWKCTL: WKEN Mask             */

#define CLK_PDSWKCTL_PRWKEN_Pos         ( 1 )                                              /*!< CLK_T::PDSWKCTL: PRWKEN Position       */
#define CLK_PDSWKCTL_PRWKEN_Msk         ( 0x1ul << CLK_PDSWKCTL_PRWKEN_Pos )               /*!< CLK_T::PDSWKCTL: PRWKEN Mask           */

#define CLK_PDSWKCTL_PFWKEN_Pos         ( 2 )                                              /*!< CLK_T::PDSWKCTL: PFWKEN Position       */
#define CLK_PDSWKCTL_PFWKEN_Msk         ( 0x1ul << CLK_PDSWKCTL_PFWKEN_Pos )               /*!< CLK_T::PDSWKCTL: PFWKEN Mask           */

#define CLK_PDSWKCTL_WKPSEL_Pos         ( 4 )                                              /*!< CLK_T::PDSWKCTL: WKPSEL Position       */
#define CLK_PDSWKCTL_WKPSEL_Msk         ( 0xful << CLK_PDSWKCTL_WKPSEL_Pos )               /*!< CLK_T::PDSWKCTL: WKPSEL Mask           */

#define CLK_PDSWKCTL_DBEN_Pos           ( 8 )                                              /*!< CLK_T::PDSWKCTL: DBEN Position         */
#define CLK_PDSWKCTL_DBEN_Msk           ( 0x1ul << CLK_PDSWKCTL_DBEN_Pos )                 /*!< CLK_T::PDSWKCTL: DBEN Mask             */

#define CLK_IOPDCTL_IOHR_Pos            ( 0 )                                              /*!< CLK_T::IOPDCTL: IOHR Position          */
#define CLK_IOPDCTL_IOHR_Msk            ( 0x1ul << CLK_IOPDCTL_IOHR_Pos )                  /*!< CLK_T::IOPDCTL: IOHR Mask              */

#define CLK_HXTFSEL_HXTFSEL_Pos         ( 0 )                                              /*!< CLK_T::HXTFSEL: HXTFSEL Position       */
#define CLK_HXTFSEL_HXTFSEL_Msk         ( 0x1ul << CLK_HXTFSEL_HXTFSEL_Pos )               /*!< CLK_T::HXTFSEL: HXTFSEL Mask           */


/**@}*/ /* CLK_CONST */
/**@}*/ /* end of CLK register group */
/**@}*/ /* end of REGISTER group */

#endif /* __CLK_REG_H__ */
